// ##정수 변수의 사용
package bitcamp.java100;

public class Test12_5{

    public static void main(String[] args)  {

// 1바이트 정수형 메모리 
        byte b1;
        b1 = 100;

        b1 = -128;
        b1 = -127;
     
        //b1 = -129;
        //b1 = 128;

        short s1;
        s1 = -32768;
        s1 = 32767;

        //s1 = -32769;
        //s1 = 32768;

        int i1;
        i1 = -21_4748_3648; 
        i1 = 21_4748_3647;
        //i1 = -21_4748_3649L;
        //i1 = 21_4748_3648L;
        //b1 = 100L;
        //s1 = 100L;
        //i1 = 100L;

        long l1;
        l1 = -922_3372_0368_5477_5808L;
        l1 = 922_3372_0368_5477_5807L;
    }
}

